Revit 2026 API

# PanelScheduleTemplateGetTableData Method

---

Gets the writable table data object.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PanelScheduleData GetTableData()
```
```vb
Public Function GetTableData As PanelScheduleData
```
```cpp
public:
PanelScheduleData^ GetTableData()
```
```fsharp
member GetTableData : unit -> PanelScheduleData
```

#### Return Value

PanelScheduleData The panel schedule data object.

Access to this information requires an open transaction.

#### Reference

PanelScheduleTemplate Class

Autodesk.Revit.DB.Electrical Namespace